// Напишите программу которая на вход принимает число и возвращает квадрат этого числа
// число умноженное само на себя
Console.WriteLine(" Hello Square =) ");
int a = 4;
Console.Write("  input -> ");
Console.WriteLine(a);
Console.Write("  Square = ");
Console.WriteLine(a * a);
